QinfendeDD/stm32_drive/F407/ADS1256/bsp_ads1256.c
/*
*********************************************************************************************************
*	函 数 名: ADS1256_StartScan
*	功能说明: 将 DRDY引脚 （PH9 ）配置成外部中断触发方式， 中断服务程序中扫描8个通道的数据。
*	形    参: _ucDiffMode : 0 表示单端模式（扫描8路）； 1表示差分模式，扫描4路
*	返 回 值: 无
*********************************************************************************************************
*/
void ADS1256_StartScan(uint8_t _ucScanMode)
{
	EXTI_InitTypeDef   EXTI_InitStructure;
	NVIC_InitTypeDef   NVIC_InitStructure;

	g_tADS1256.ScanMode = _ucScanMode;
	/* 开始扫描前, 清零结果缓冲区 */
	{
		uint8_t i;

		g_tADS1256.Channel = 0;

		for (i = 0; i < 8; i++)
		{
			g_tADS1256.AdcNow[i] = 0;
		}
	}

	/* Enable AFIO clock */
  //RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);//  f103
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);//使能SYSCFG时钟  f407
	/* Connect EXTI3 Line to PE3 pin */
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOE, EXTI_PinSource3);//PE3 连接到中断线3  f407
	//GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_Pin_3);   //f103

	/* Configure EXTI3 line */
	EXTI_InitStructure.EXTI_Line = EXTI_Line3;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  /* 下降沿 */
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);

	/* Enable and set EXTI3 Interrupt  priority */
	NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x03;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x03;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/*
*********************************************************************************************************
*	函 数 名: ADS1256_StopScan
*	功能说明: 停止 DRDY 中断
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void ADS1256_StopScan(void)
{
	EXTI_InitTypeDef   EXTI_InitStructure;
	NVIC_InitTypeDef   NVIC_InitStructure;

	/* 配置 EXTI LineXXX */
	EXTI_InitStructure.EXTI_Line = EXTI_Line3;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;	/* 下降沿(等待 DRDY 由1变0的时刻) */
	EXTI_InitStructure.EXTI_LineCmd = DISABLE;		/* 禁止 */
	EXTI_Init(&EXTI_InitStructure);

	/* 中断优先级配置 最低优先级 这里一定要分开的设置中断，不能够合并到一个里面设置 */
	NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x03;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x03;
	NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;		/* 禁止 */
	NVIC_Init(&NVIC_InitStructure);
}

/*
*********************************************************************************************************
*	函 数 名: ADS1256_GetAdc
*	功能说明: 从缓冲区读取ADC采样结果。采样结构是由中断服务程序填充的。
*	形    参: _ch 通道号 (0 - 7)
*	返 回 值: ADC采集结果（有符号数）
*********************************************************************************************************
*/
int32_t ADS1256_GetAdc(uint8_t _ch)
{
	int32_t iTemp;

	if (_ch > 7)
	{
		return 0;
	}

	__set_PRIMASK(1);	/* 禁止中断 */

	iTemp = g_tADS1256.AdcNow[_ch];

	__set_PRIMASK(0);	/* 使能中断 */

	return iTemp;
}

/*
*********************************************************************************************************
*	函 数 名: ADS1256_ISR
*	功能说明: 定时采集中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void ADS1256_ISR(void)
{
	if (g_tADS1256.ScanMode == 0)	/* 0 表示单端8路扫描，1表示差分4路扫描 */
	{
		/* 读取采集结构，保存在全局变量 */
		ADS1256_SetChannal(g_tADS1256.Channel);	/* 切换模拟通道 */
		bsp_DelayUS(5);

		ADS1256_WriteCmd(CMD_SYNC);
		bsp_DelayUS(5);

		ADS1256_WriteCmd(CMD_WAKEUP);
		bsp_DelayUS(25);

		if (g_tADS1256.Channel == 0)
		{
			g_tADS1256.AdcNow[7] = ADS1256_ReadData();	/* 注意保存的是上一个通道的数据 */
		}
		else
		{
			g_tADS1256.AdcNow[g_tADS1256.Channel-1] = ADS1256_ReadData();	/* 注意保存的是上一个通道的数据 */
		}

		if (++g_tADS1256.Channel >= 8)
		{
			g_tADS1256.Channel = 0;
		}
	}
	else	/* 差分4路扫描 */
	{
		/* 读取采集结构，保存在全局变量 */
		ADS1256_SetDiffChannal(g_tADS1256.Channel);	/* 切换模拟通道 */
		bsp_DelayUS(5);

		ADS1256_WriteCmd(CMD_SYNC);
		bsp_DelayUS(5);

		ADS1256_WriteCmd(CMD_WAKEUP);
		bsp_DelayUS(25);

		if (g_tADS1256.Channel == 0)
		{
			g_tADS1256.AdcNow[3] = ADS1256_ReadData();	/* 注意保存的是上一个通道的数据 */
		}
		else
		{
			g_tADS1256.AdcNow[g_tADS1256.Channel-1] = ADS1256_ReadData();	/* 注意保存的是上一个通道的数据 */
		}

		if (++g_tADS1256.Channel >= 4)
		{
			g_tADS1256.Channel = 0;
		}
	}
}


/*
*********************************************************************************************************
*	函 数 名: EXTI3_IRQHandler
*	功能说明: 外部中断服务程序.
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void EXTI3_IRQHandler(void)
{
	if (EXTI_GetITStatus(EXTI_Line3) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line3);		/* 清除中断标志位 */

		ADS1256_ISR();

		/* 执行上面的代码完毕后，再次清零中断标志 */
		EXTI_ClearITPendingBit(EXTI_Line3);		/* 清除中断标志位 */
	}
}
/*
获取ads1256的ID编号

*/	
void ads1256_id()
{
	uint8_t id;
	id = ADS1256_ReadChipID();
	printf("\r\n");
	printf("读取芯片ID\r\n");
	if (id != 3)
	{
		printf( "Error, ASD1256 Chip ID = 0x%X\r\n", id);
	}//infoBackPC,infoBackPC, 
	else
	{
		printf("Ok, ASD1256 Chip ID = 0x%X\r\n", id);
	}
//	USB_TxWrite((uint8_t*)infoBackPC, strlen(infoBackPC));
}
void ads1256_allocation() //配置ads1256
{
	uint8_t ch_num;
	uint8_t i;
	/* 设置PGA增益，数据更新速率 */
#if 1
	printf("\r\nPGA增益 = 1, 数据输出速率 = 15sps, 单端8路扫描\r\n\r\n");
	ADS1256_CfgADC(ADS1256_GAIN_1, ADS1256_15SPS);	/* 配置ADC参数： 增益1:1, 数据输出速率 15Hz */
	/*中断服务程序会自动读取ADC结果保存在全局变量，主程序通过 ADS1256_GetAdc() 函数来读取这些数据*/
	ADS1256_StartScan(0);	/* 启动中断扫描模式. 0表示单端8路，1表示差分4路 */
	ch_num = 8;		/* 通道数 = 8 或者4 */
#else
	USB_SendStr("\r\nPGA增益 = 1, 数据输出速率 = 15sps, 差分4路扫描\r\n\r\n");
	ADS1256_CfgADC(ADS1256_GAIN_1, ADS1256_15SPS);	/* 配置ADC参数： 增益1:1, 数据输出速率 15Hz */
	/* 中断服务程序会自动读取ADC结果保存在全局变量，主程序通过 ADS1256_GetAdc() 函数来读取这些数据*/
	ADS1256_StartScan(1);	/* 启动中断扫描模式. 0表示单端8路，1表示差分4路 */
	ch_num = 4;		/* 通道数 = 8 或者4 */
#endif	
	while(1)
	{
		for (i = 0; i < ch_num; i++)
		{
			/* 从全局缓冲区读取采样结果。 采样结果是在中断服务程序中读取的。*/
			adc[i] = ADS1256_GetAdc(i);

			/* 4194303 = 2.5V , 这是理论值，实际可以根据2.5V基准的实际值进行公式矫正 */
			volt[i] = ((int64_t)adc[i] * 2500000) / 4194303;	/* 计算实际电压值（近似估算的），如需准确，请进行校准 */
		}

		/* 打印采集数据 */
		
			int32_t iTemp;
			//upToPC = 0;infoBackPC,
			printf( "[%dCH_NUM]\r\n", ch_num);
			//USB_TxWrite((uint8_t*)infoBackPC, strlen(infoBackPC));
			for (i = 0; i < ch_num; i++)
			{
				iTemp = volt[i];	/* 余数，uV  */
				if (iTemp < 0)
				{
					iTemp = -iTemp;
					printf( "%d=%6d,(-%d.%03d %03d V) \r\n", i, adc[i], iTemp /1000000, (iTemp%1000000)/1000, iTemp%1000);
				}//infoBackPC,infoBackPC,
				else
				{
					printf("%d=%6d,( %d.%03d %03d V) \r\n", i, adc[i], iTemp/1000000, (iTemp%1000000)/1000, iTemp%1000);
				}
				//USB_TxWrite((uint8_t*)infoBackPC, strlen(infoBackPC));
			}
//			//在液晶均显示8通道电压，单位0.1mv
//			for(i = 0; i < 4; i++)
//			{
//				printf("CH%d", i*2);
//				//LCD_ShowString(1,0 , i*16, (const u8*)infoShowLCD);
//				//LCD_Refresh_Gram();infoShowLCD, 
//				printf( "%05d", volt[i*2]/100);
//				//LCD_ShowString(0,24 , i*16, (const u8*)infoShowLCD);
//				//LCD_Refresh_Gram();infoShowLCD,

//				printf("CH%d", i*2+1);
//				//LCD_ShowString(1,64 , i*16, (const u8*)infoShowLCD);
//				//LCD_Refresh_Gram();infoShowLCD, 
//				printf("%05d", volt[i*2+1]/100);
//				//LCD_ShowString(0,88 , i*16, (const u8*)infoShowLCD);
//				//LCD_Refresh_Gram();infoShowLCD, 
//			}
	}
}
